lukejin-dev/upiot-nrf52833/apps/ble_app_hrs_nfc_pairing/src/main.c
#define DEAD_BEEF 0xDEADBEEF /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#ifndef NFC_PAIRING_MODE
#define NFC_PAIRING_MODE NFC_PAIRING_MODE_JUST_WORKS
#endif

APP_TIMER_DEF(m_battery_timer_id);        /**< Battery timer. */
APP_TIMER_DEF(m_heart_rate_timer_id);     /**< Heart rate measurement timer. */
APP_TIMER_DEF(m_rr_interval_timer_id);    /**< RR interval timer. */
APP_TIMER_DEF(m_sensor_contact_timer_id); /**< Sensor contact detected timer. */

BLE_BAS_DEF(m_bas);       /**< Structure used to identify the battery service. */
BLE_HRS_DEF(m_hrs);       /**< Heart rate service instance. */
NRF_BLE_GATT_DEF(m_gatt); /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);   /**< Context for the Queued Write module.*/

static ble_advertising_t m_advertising; /**< Advertising module instance. */
NRF_SDH_BLE_OBSERVER(m_adv_ble_obs, BLE_ADV_BLE_OBSERVER_PRIO, ble_advertising_on_ble_evt, &m_advertising);

static bool m_rr_interval_enabled = true; /**< Flag for enabling sending RR interval measurements. */

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID; /**< Handle of the current connection. */

static sensorsim_cfg_t m_battery_sim_cfg;         /**< Battery Level sensor simulator configuration. */
static sensorsim_state_t m_battery_sim_state;     /**< Battery Level sensor simulator state. */
static sensorsim_cfg_t m_heart_rate_sim_cfg;      /**< Heart Rate sensor simulator configuration. */
static sensorsim_state_t m_heart_rate_sim_state;  /**< Heart Rate sensor simulator state. */
static sensorsim_cfg_t m_rr_interval_sim_cfg;     /**< RR Interval sensor simulator configuration. */
static sensorsim_state_t m_rr_interval_sim_state; /**< RR Interval sensor simulator state. */

static ble_uuid_t m_adv_uuids[] = /**< Universally unique service identifiers. */
    {
        {BLE_UUID_HEART_RATE_SERVICE, BLE_UUID_TYPE_BLE},
        {BLE_UUID_BATTERY_SERVICE, BLE_UUID_TYPE_BLE},
        {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}};

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const *p_evt)
{
    ret_code_t err_code;

    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
    /** @snippet [NFC Pairing Lib usage_1] */
    case PM_EVT_CONN_SEC_PARAMS_REQ:
    {
        // Send event to the NFC BLE pairing library as it may dynamically alternate
        // security parameters to achieve highest possible security level.
        err_code = nfc_ble_pair_on_pm_params_req(p_evt);
        APP_ERROR_CHECK(err_code);
    }
    break;
        /** @snippet [NFC Pairing Lib usage_1] */

    default:
        break;
    }
}

/**@brief Function for performing battery measurement and updating the Battery Level characteristic
 *        in Battery Service.
 */
static void battery_level_update(void)
{
    ret_code_t err_code;
    uint8_t battery_level;

    //UP_INFO("==> battery_level_update");

    battery_level = (uint8_t)sensorsim_measure(&m_battery_sim_state, &m_battery_sim_cfg);

    err_code = ble_bas_battery_level_update(&m_bas, battery_level, BLE_CONN_HANDLE_ALL);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_BUSY) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING))
    {
        APP_ERROR_HANDLER(err_code);
    }
}

/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void *p_context)
{
    UNUSED_PARAMETER(p_context);
    battery_level_update();
}

/**@brief Function for handling the Heart rate measurement timer timeout.
 *
 * @details This function will be called each time the heart rate measurement timer expires.
 *          It will exclude RR Interval data from every third measurement.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void heart_rate_meas_timeout_handler(void *p_context)
{
    static uint32_t cnt = 0;
    ret_code_t err_code;
    uint16_t heart_rate;

    UNUSED_PARAMETER(p_context);

    heart_rate = (uint16_t)sensorsim_measure(&m_heart_rate_sim_state, &m_heart_rate_sim_cfg);

    cnt++;
    err_code = ble_hrs_heart_rate_measurement_send(&m_hrs, heart_rate);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_BUSY) &&
        (err_code != NRF_ERROR_FORBIDDEN) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING))
    {
        APP_ERROR_HANDLER(err_code);
    }

    // Disable RR Interval recording every third heart rate measurement.
    // NOTE: An application will normally not do this. It is done here just for testing generation
    // of messages without RR Interval measurements.
    m_rr_interval_enabled = ((cnt % 3) != 0);
}

/**@brief Function for handling the RR interval timer timeout.
 *
 * @details This function will be called each time the RR interval timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void rr_interval_timeout_handler(void *p_context)
{
    UNUSED_PARAMETER(p_context);

